
#HANDLERS:


#Start
class StartHandler:
    START=(
        "Приветствую! 👋 \n"
        "Этот бот поможет Вам подключить подписку и сразу получить доступ к закрытому каналу."
    )

#SubBuy
class TariffHandler:
    TARIFF = "Отлично! Теперь выбери тариф😊"
    TARIFF_SELECTED=(
    "📌Вы выбрали тариф «{title}».\n\n"
    "Подтвердить оплату?🤔"
    )

class InvoiceHandler:
    INVOICE_LABEL="Подписка {tariff}"
    INVOICE_TITLE="Подписка"
    CURRENCY="RUB"

class SuccessfulPayment:
    UNKNOWN_TARIFF="❌ Неизвестный тариф. Обратитесь к поддержке."
    SUCCESSFUL_INVITE=(
        "✅ Оплата прошла успешно!\n\n"
        "📋 Тариф: {title}\n"
        "📅 Подписка активна до {end_date}\n\n"
        "🎉 Доступ к закрытому каналу активирован!"
    )
    UNSUCCESSFUL_INVITE = (
        "✅ Оплата прошла успешно!\n\n"
        "📋 Тариф: {title}\n"
        "📅 Подписка активна до {end_date}\n\n"
        "⚠️ Не удалось автоматически добавить вас в канал. "
        "Обратитесь к <a href='https://t.me/{admin_username}'>администратору</a> " 
        "для получения доступа."
    )
    INVITE_LINK="\n\n🔗 Ссылка на канал: {invite_link}\n(действует 24 часа)"
    ACTIVATE_ERROR=(
        "❌ Произошла ошибка при активации подписки. "
        "Ваш платеж зарегистрирован. Обратитесь к <a href='https://t.me/{admin_username}'>поддержке.</a>"
    )

#CheckSub
class CheckSubHandlers:
    SUBSCRIPTION_EXPIRED=(
        "⚠️ Ваша подписка закончилась {end_date}.\n"
        "Вы можете продлить подписку, чтобы снова получить доступ к закрытому каналу."
    )
    SUBSCRIPTION_ACTIVE_UNTIL="📅 Ваша подписка активна до <b>{end_date}</b>.\n"
    DAYS_LEFT="Осталось дней: <b>{days_left}</b>."
    DONT_HAVE_SUBSCRIPTION=(
        "⚠️ У Вас нет активной подписки.\n"
        "Вы можете оформить её, чтобы получить доступ к закрытому каналу."
    )

#ADMIN

#Users
class AdminUsersMenu:
    USER_MANAGE_MENU="Меню управления юзерами"

class AdminUserAction:
    ENTER_USERNAME="Введите ник пользователя, которого нужно найти."
    INCORRECT_DATA="Некорректные данные."
    INCORRECT_DATA_FORMAT="Некорректный формат даты. Используйте ДД.ММ.ГГГГ, например 25.12.2026"
    CANNOT_IDENTIFY_USER="Не удалось определить пользователя. Попробуйте снова через меню админа."
    SET_NEW_DATE=(
        "Введите новую дату окончания подписки для пользователя {username} "
        "в формате ДД.ММ.ГГГГ.\n"
        "Например: 25.12.2026\n"
    )
    USER_NOT_FOUND_OR_DELETED= "Пользователь не найден или уже удалён."
    BACK_TO_USERS_ADMIN_MENU="Админ: управление пользователями"


class AdminUsersHelpersText:
    FORMAT_SHORT= "🟢 активна, до {date} ({days_left} дн.)"
    FORMAT_DETAIL=(
        "👤 <b>Пользователь</b>"
        "ID: <code>{id}</code>"
        "Username: @{username}"
        "Создан: {date}"
    )
    USER_NOT_FOUND="Пользователь не найден"
    USER_SUCCESSFULLY_DELETED="Пользователь успешно удален"


#Tariff

class AdminAllTariffText:
    TARIFF_DETAILED_LINE=(
        "📦 <b>Тариф</b>\n"
        "ID: <code>{id}</code>\n"
        "Название: {title}\n"
        "Дней доступа: {days}\n"
        "Цена: {price}₽\n"
        "Payload: <code>{payload}</code>\n"
        "Горячий: {hot}\n"
        "Активен: {is_active}"
    )

#BUTTONS:

#start_keyboard
class StartKeyboard:
    BUY_SUBSCRIPTION="✨Приобрести подписку✨"
    CHECK_SUBSCRIPTION="🔎📂Посмотреть текущую подписку🔎📂"

#renewkeyboard
class RenewKeyboard:
    BUY_SUBSCRIPTION="💳 Приобрести подписку"

#paymentkeyboard
class PaymentKeyboard:
    PAY="💳 Оплатить"
    CANCEL_PAYMENT="⛔ Отменить оплату"

#admin_users_keyboard
class AdminUsersKeyboard:
    EXTEND_DAYS="➕ +{days} дней"
    SET_THE_DATE="📅 Установить дату"
    CANCEL_SUB="✂ Отменить подписку"
    DELETE_USER="🗑 Удалить пользователя"
    BACK_TO_ADMIN_MENU="⬅ В админ-меню"
    USERNAME_SEARCH="🔍 Поиск по нику"




