
#HANDLERS:


#Start
class StartHandler:
    START=(
        "Приветствую! 👋 \n"
        "Этот бот поможет Вам подключить подписку и сразу получить доступ к закрытому каналу."
    )

#SubBuy
class TariffHandler:
    TARIFF = "Отлично! Теперь выбери тариф😊"
    TARIFF_SELECTED=(
    "📌Вы выбрали тариф «{title}».\n\n"
    "Подтвердить оплату?🤔"
    )

class InvoiceHandler:
    INVOICE_LABEL="Подписка {tariff}"
    INVOICE_TITLE="Подписка"
    CURRENCY="RUB"

class SuccessfulPayment:
    UNKNOWN_TARIFF="❌ Неизвестный тариф. Обратитесь к поддержке."
    SUCCESSFUL_INVITE=(
        "✅ Оплата прошла успешно!\n\n"
        "📋 Тариф: {title}\n"
        "📅 Подписка активна до {end_date}\n\n"
        "🎉 Доступ к закрытому каналу активирован!"
    )
    UNSUCCESSFUL_INVITE = (
        "✅ Оплата прошла успешно!\n\n"
        "📋 Тариф: {title}\n"
        "📅 Подписка активна до {end_date}\n\n"
        "⚠️ Не удалось автоматически добавить вас в канал. "
        "Обратитесь к <a href='https://t.me/{admin_username}'>администратору</a> " 
        "для получения доступа."
    )
    INVITE_LINK="\n\n🔗 Ссылка на канал: {invite_link}\n(действует 24 часа)"
    ACTIVATE_ERROR=(
        "❌ Произошла ошибка при активации подписки. "
        "Ваш платеж зарегистрирован. Обратитесь к <a href='https://t.me/{admin_username}'>поддержке.</a>"
    )

#CheckSub
class CheckSubHandlers:
    SUBSCRIPTION_EXPIRED=(
        "⚠️ Ваша подписка закончилась {end_date}.\n"
        "Вы можете продлить подписку, чтобы снова получить доступ к закрытому каналу."
    )
    SUBSCRIPTION_ACTIVE_UNTIL="📅 Ваша подписка активна до <b>{end_date}</b>.\n"
    DAYS_LEFT="Осталось дней: <b>{days_left}</b>."
    DONT_HAVE_SUBSCRIPTION=(
        "⚠️ У Вас нет активной подписки.\n"
        "Вы можете оформить её, чтобы получить доступ к закрытому каналу."
    )

#BUTTONS:

#start_keyboard
class StartKeyboard:
    BUY_SUBSCRIPTION="✨Приобрести подписку✨"
    CHECK_SUBSCRIPTION="🔎📂Посмотреть текущую подписку🔎📂"

#renewkeyboard
class RenewKeyboard:
    BUY_SUBSCRIPTION="💳 Приобрести подписку"

#paymentkeyboard
class PaymentKeyboard:
    PAY="💳 Оплатить"
    CANCEL_PAYMENT="⛔ Отменить оплату"

#admin_users_keyboard
class AdminUsersKeyboard:
    EXTEND_DAYS="➕ +{days} дней"
    SET_THE_DATE="📅 Установить дату"
    CANCEL_SUB="✂ Отменить подписку"
    DELETE_USER="🗑 Удалить пользователя"
    BACK_TO_ADMIN_MENU="⬅ В админ-меню"
    USERNAME_SEARCH="🔍 Поиск по нику"




